Управление_атракционами/src/Documents/ПосещенияАттракциона/ПосещенияАттракциона.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПосещенияАттракциона</name>
  <registerRecords>AccumulationRegister.АктивныеПосещения</registerRecords>
  <attributes>
    <name>Аттракцион</name>
    <type>
      <types>CatalogRef.Атракционы</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПродажаБилета</types>
    </type>
  </attributes>
</mdclass:Document>

Управление_атракционами/src/AccumulationRegisters/АктивныеПосещения/АктивныеПосещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>АктивныеПосещения</name>
  <resources>
    <name>КоличествПосещений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Аттракцион</name>
    <type>
      <types>CatalogRef.Атракционы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПродажаБилета</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Управление_атракционами/src/Documents/ПосещенияАттракциона/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)

	// регистр АктивныеПосещения
	Движения.АктивныеПосещения.Записывать = Истина;
	Движение = Движения.АктивныеПосещения.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Аттракцион = Аттракцион;
	Движение.Основание = Основание;
	Движение.КоличествПосещений = 1;
	
	Движения.Записать();
	
	// проверка на отрицательный остатко по новой методике

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	АктивныеПосещенияОстатки.Аттракцион
		|ИЗ
		|	РегистрНакопления.АктивныеПосещения.Остатки(, Основание = &Основание) КАК АктивныеПосещенияОстатки
		|ГДЕ
		|	АктивныеПосещенияОстатки.КоличествПосещенийОстаток < 0";
	
	Запрос.УстановитьПараметр("Основание", Основание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		Сообщить("Заяц");
	КонецЕсли;
	 
	 
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
